# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import numpy as np
import pandas as pd

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [3]:
np.random.seed(101)
s1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
s2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
s3 = pd.Series(np.random.randint(10000, high=30001, size=100, dtype='l'))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [6]:
housemkt = pd.concat([s1, s2, s3], axis=1)
housemkt.head()

   0  1      2
0  4  3  11015
1  4  3  13194
2  2  2  24571
3  3  3  15106
4  4  2  20727

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [8]:
housemkt.rename(columns = {0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'}, inplace=True) ##For Renaming
housemkt.head()

   bedrs  bathrs  price_sqr_meter
0      4       3            11015
1      4       3            13194
2      2       2            24571
3      3       3            15106
4      4       2            20727

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [11]:
bigcolumn=pd.concat([s1, s2, s3])

pd.DataFrame(bigcolumn)

        0
0       4
1       4
2       2
3       3
4       4
..    ...
95  24383
96  21068
97  19862
98  19313
99  26821

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [12]:
# no the index are kept but the length of the DataFrame is 300
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [13]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

0          4
1          4
2          2
3          3
4          4
       ...
295    24383
296    21068
297    19862
298    19313
299    26821
Length: 300, dtype: int32

reset_index(): This method resets the index of the DataFrame, turning the existing index into a column and creating a new default integer index.

drop=True: This parameter ensures that the old index is not added as a new column in the DataFrame.

inplace=True: This parameter modifies the original DataFrame directly rather than creating a new one.